[
    {
        "image": {
            "url": "/portfolio/localoka-mock.jpeg",
            "alt": "localoka"
        },
        "isSelected": true,
        "title": "Localoka",
        "slug": "localoka",
        "position": "As a Backend Developer",
        "estimate": {
            "start": "2024-10",
            "end": "2025-10"
        },
        "brief": "Localoka is a digital marketing platform initiated by Bank Rakyat Indonesia (BRI) to help BRI-assisted MSMEs expand their market reach online. Through Localoka, business owners can showcase, promote, and manage their products to make them more discoverable by potential buyers across Indonesia.",
        "responsibilities": [
            "Developed new features by translating business needs into efficient and scalable backend solutions.",
            "Performed debugging and bug fixing to improve application stability and performance.",
            "Maintained code quality through code reviews, best practices implementation, and comprehensive technical documentation.",
            "Implemented and strengthened server-side security layers to protect user data and digital transactions.",
            "Collaborated with frontend, mobile, and product teams to ensure smooth system integration."
        ],
        "result": "Successfully developed new features and resolved bugs in the Localoka application, leading to improved stability and user satisfaction. The platform now supports thousands of active users and helps hundreds of BRI-assisted MSMEs increase their visibility and sales in the national digital market.",
        "stacks": ["Flask", "PostgreSQL", "Golang", "Rabbit", "Redis", "Docker", "Next.js", "Flutter", "Microservices"]
    },
    {
        "image": {
            "url": "/portfolio/zavis-voucher-mock.jpeg",
            "alt": "zavis voucher"
        },
        "isSelected": true,
        "title": "Zavis",
        "slug": "zavis",
        "position": "As a Fullstack Developer",
        "estimate": {
            "start": "2023-10",
            "end": "2024-01"
        },
        "brief": "Zavis is a loyalty membership application designed to collect points that can be redeemed for various exciting promotions and rewards.",
        "responsibilities": [
            "Developed new features by translating business requirements into efficient and scalable backend solutions.",
            "Performed debugging and bug fixing to improve system stability and performance.",
            "Maintained code quality through code reviews, best practice implementations, and clear technical documentation.",
            "Enhanced server-side security to protect user data and digital transactions.",
            "Collaborated with UI/UX and product teams to ensure seamless integration across systems."
        ],
        "result": "The Zavis application was successfully launched and adopted by thousands of active users, receiving positive feedback for its functionality and usability.",
        "stacks": ["Laravel", "jQuery", "Bootstrap", "MySQL"]
    },
    {
        "image": {
            "url": "/portfolio/vocaject-mock.jpeg",
            "alt": "mock vocaject application"
        },
        "isSelected": true,
        "title": "Vocational Project (Vocaject)",
        "slug": "vocational-project",
        "position": "As a Fullstack Developer",
        "estimate": {
            "start": "2023-06",
            "end": "2023-08"
        },
        "brief": "Vocaject is a platform that connects university students with industries or individuals seeking skilled professionals for specific projects. It enables students to hone practical skills, expand professional networks, and build real-world portfolios with institutional support. The application was developed as the main project for the Hackathon of the National Polytechnic Informatics Student Competition (KMIPN).",
        "responsibilities": [
            "Defined the vision, goals, and project scope for Vocaject.",
            "Designed the application architecture, including database structure, technology stack, and system design.",
            "Developed the backend using Laravel with RESTful API architecture.",
            "Built the web frontend using Nuxt.js and TailwindCSS for a modern and responsive interface.",
            "Integrated real-time notification systems using Pusher.",
            "Deployed the system on Google Cloud Platform (GCP) for scalability and reliability.",
            "Managed project coordination and team workflow to ensure on-time development and delivery."
        ],
        "result": "The Vocaject team won 3rd place at KMIPN and received positive recognition from academic and industry judges for its innovation and implementation potential.",
        "stacks": ["Laravel", "Nuxt.js", "Tailwind", "Flutter", "MySQL", "Pusher", "GCP"]
    },
    {
        "image": {
            "url": "/portfolio/arahku-mock.jpeg",
            "alt": "mock arahku application"
        },
        "isSelected": true,
        "title": "Arahku",
        "slug": "arahku",
        "estimate": {
            "start": "2023-05",
            "end": "2023-06"
        },
        "position": "As a Backend Developer",
        "brief": "Arahku is a machine learning–based application that helps prospective students discover their potential and find the most suitable educational path. By answering a set of questions about interests and personality, the system analyzes data to identify strengths and recommend universities and majors that fit best. Arahku was developed as a Capstone Project in the Bangkit Academy 2023 program.",
        "responsibilities": [
            "Defined the project vision, objectives, and development scope for Arahku.",
            "Designed backend architecture including database schema, API structure, and supporting technologies.",
            "Developed the backend using Flask with a RESTful API architecture to support cross-platform integration.",
            "Integrated a TensorFlow-based machine learning model into the backend system.",
            "Built a secure and efficient authentication and user data management system.",
            "Deployed and tested the system on Google Cloud Platform (GCP) to ensure performance, scalability, and reliability."
        ],
        "result": "The Arahku team was recognized as one of the top 68 Capstone teams out of 700+ teams in Bangkit Academy 2023, receiving positive feedback from judges and reviewers for innovation and system accuracy.",
        "stacks": ["Flask", "Kotlin", "PostgreSQL", "TensorFlow", "GCP"]
    },
    {
        "image": {
            "url": "/portfolio/kopi-pas-mock.jpeg",
            "alt": "mock kopi pas application"
        },
        "isSelected": false,
        "title": "Kopi Pas Application",
        "slug": "aplikasi-kopi-pas",
        "estimate": {
            "start": "2022-10",
            "end": "2022-12"
        },
        "position": "As a Backend Developer",
        "brief": "Kopi Pas is a mobile-based coffee shop management application designed to streamline order processing, menu management, and customer loyalty programs. It was developed as a semester project to enhance operational efficiency for small-scale coffee businesses.",
        "responsibilities": [
            "Designed backend architecture using Laravel with MVC concept.",
            "Built APIs to manage menu data, orders, and user authentication.",
            "Integrated the backend with the Flutter mobile frontend.",
            "Optimized database design in MySQL for faster query performance.",
            "Collaborated with frontend developers to ensure smooth API communication."
        ],
        "result": "The Kopi Pas application successfully demonstrated seamless order processing and was adopted by small coffee shop owners for pilot use.",
        "stacks": ["Laravel", "Tailwind", "Flutter", "Vue.js", "MySQL"]
    },
    {
        "image": {
            "url": "/portfolio/web-policy-mock.jpeg",
            "alt": "mock web policy"
        },
        "isSelected": false,
        "title": "Official Website of UKM-POLICY",
        "slug": "website-official-ukm-policy",
        "estimate": {
            "start": "2021-09",
            "end": "2021-11"
        },
        "position": "As a Backend Developer",
        "brief": "The Official Website of UKM-POLICY serves as the digital hub for the Programming Community (POLICY) student organization, providing information, event documentation, and publication channels. The website was designed to strengthen the organization’s digital presence and facilitate communication among members and the public.",
        "responsibilities": [
            "Designed and developed backend architecture using Laravel with MVC design pattern.",
            "Built a content management system (CMS) for managing news, activities, and membership data.",
            "Structured the database using MySQL for efficient data storage and access.",
            "Collaborated with the frontend team to integrate designs using TailwindCSS.",
            "Conducted testing and debugging to ensure the website’s stability before public launch."
        ],
        "result": "The UKM-POLICY website was successfully launched as the official organizational platform, actively used for event publications and member communication.",
        "stacks": ["Laravel", "Tailwind", "MySQL"]
    },
    {
        "image": {
            "url": "/portfolio/wiraku-mock.jpeg",
            "alt": "mock wiraku application"
        },
        "isSelected": false,
        "title": "Wiraku",
        "slug": "wiraku",
        "position": "As a Frontend Developer",
        "estimate": {
            "start": "2021-06",
            "end": "2021-08"
        },
        "brief": "Wiraku is a digital learning platform focused on developing young entrepreneurs in Indonesia. It offers online courses, business articles, and interactive communities to help users expand their knowledge and entrepreneurial skills.",
        "responsibilities": [
            "Developed responsive and modern user interfaces using Vue.js and TailwindCSS.",
            "Implemented designs based on wireframes and established UI/UX guidelines.",
            "Built the homepage, course dashboard, and training detail pages.",
            "Integrated dynamic data from backend APIs using Axios.",
            "Optimized frontend performance for accessibility and fast loading times across devices.",
            "Coordinated with the backend team to ensure smooth data and feature integration."
        ],
        "result": "The Wiraku website successfully delivered a modern and interactive user interface, providing an accessible learning experience for aspiring digital entrepreneurs.",
        "stacks": ["Laravel", "Vue.js", "Tailwind", "MySQL"]
    }
]
