
[
    {
        "image": {
            "url": "/portfolio/localoka-mock.jpeg",
            "alt": "localoka"
        },
        "isSelected": true,
        "title": "Localoka",
        "slug": "localoka",
        "position": "As a Backend Developer",
        "estimate": {
            "start": "2024-10",
            "end": "2025-10"
        },
        "brief": "Localoka adalah platform pemasaran digital yang diinisiasi oleh Bank Rakyat Indonesia (BRI) untuk membantu UMKM binaan BRI memperluas jangkauan pasar mereka secara online. Melalui Localoka, para pelaku usaha dapat menampilkan, mempromosikan, dan mengelola produk mereka agar lebih mudah ditemukan oleh calon pembeli di seluruh Indonesia.",
        "responsibilities": [
            "Mengembangkan fitur-fitur baru dengan menerjemahkan kebutuhan bisnis menjadi solusi backend yang efisien dan skalabel.",
            "Melakukan debugging serta perbaikan bug untuk meningkatkan stabilitas dan performa aplikasi.",
            "Menjaga kualitas kode melalui code review, penerapan best practice, dan dokumentasi teknis yang rapi.",
            "Menerapkan dan memperkuat lapisan keamanan pada sisi server untuk melindungi data pengguna dan transaksi digital.",
            "Berkolaborasi dengan tim frontend, mobile, dan product untuk memastikan integrasi sistem berjalan lancar."
        ],
        "result": "Fitur-fitur baru dari aplikasi Localoka berhasil dikembangkan dengan efektif dan bugs yang terjadi di aplikasi Localoka berhasil ditangani dan teratasi sehingga memuaskan ribuan pengguna aktif, membantu ratusan UMKM binaan BRI meningkatkan visibilitas dan penjualan produk mereka di pasar digital nasional.",
        "stacks": ["Flask", "PostgreSql", "Golang", "Rabbit", "Redis", "Docker", "Next.js", "Flutter", "Microservices"]
    },
    {
        "image": {
            "url": "/portfolio/zavis-voucher-mock.jpeg",
            "alt": "zavis voucher"
        },
        "isSelected": true,
        "title": "Zavis",
        "slug": "zavis",
        "position": "As a Fullstack Developer",
        "estimate": {
            "start": "2023-10",
            "end": "2024-01"
        },
        "brief": "Zavis merupakan aplikasi Loyaliti Member Yang Digunakan Untuk mengumpulkan Poin dan Dapat Ditukarkan Dengan Berbagai Promo Yang Menarik.",
        "responsibilities": [
            "Mengembangkan fitur-fitur baru dengan menerjemahkan kebutuhan bisnis menjadi solusi backend yang efisien dan skalabel.",
            "Melakukan debugging serta perbaikan bug untuk meningkatkan stabilitas dan performa aplikasi.",
            "Menjaga kualitas kode melalui code review, penerapan best practice, dan dokumentasi teknis yang rapi.",
            "Menerapkan dan memperkuat lapisan keamanan pada sisi server untuk melindungi data pengguna dan transaksi digital.",
            "Berkolaborasi dengan tim ui/ux dan product untuk memastikan integrasi sistem berjalan lancar."
        ],
        "result": "Aplikasi Zavis berhasil diluncurkan dan digunakan oleh ribuan pengguna aktif dan mendapatkan feedback positif dari pengguna.",
        "stacks": ["Laravel", "JQuery", "Bootstrap", "MySql"]
    },
    {
        "image": {
            "url": "/portfolio/vocaject-mock.jpeg",
            "alt": "mock vocaject application"
        },
        "isSelected": true,
        "title": "Vocational Project (Vocaject)",
        "slug": "vocational-project",
        "position": "As a Fullstack Developer",
        "estimate": {
            "start": "2023-06",
            "end": "2023-08"
        },
        "brief": "Vocaject adalah aplikasi yang menghubungkan Mahasiswa dengan industri atau individu yang membutuhkan tenaga ahli untuk mengerjakan proyek tertentu. Platform ini memberikan kesempatan bagi Mahasiswa untuk mengasah keterampilan praktis, memperluas jaringan profesional, serta membangun portofolio kerja nyata dengan dukungan kampus sebagai pihak penjamin. Aplikasi ini dikembangkan sebagai proyek utama dalam ajang Hackathon Kompetisi Mahasiswa Informatika Politeknik Nasional (KMIPN).",
        "responsibilities": [
            "Menentukan visi, tujuan, dan ruang lingkup proyek Vocaject.",
            "Merancang arsitektur aplikasi, termasuk struktur database, pemilihan teknologi, dan desain sistem.",
            "Mengembangkan sisi Backend menggunakan Laravel dengan arsitektur RESTful API.",
            "Membangun sisi Frontend Web menggunakan Nuxt.js dan TailwindCSS untuk antarmuka yang modern dan responsif.",
            "Mengintegrasikan sistem notifikasi real-time menggunakan Pusher.",
            "Menerapkan deployment di Google Cloud Platform (GCP) untuk skalabilitas dan reliabilitas sistem.",
            "Mengelola manajemen proyek dan koordinasi antar anggota tim agar pengembangan berjalan efektif dan sesuai target."
        ],
        "result": "Tim Vocaject berhasil meraih Juara 3 di ajang KMIPN dan mendapatkan apresiasi positif dari pihak akademisi serta industri nasional karena inovasi dan potensi implementatifnya.",
        "stacks": ["Laravel", "Nuxt.js", "Tailwind", "Flutter", "MySQL", "Pusher", "GCP"]
    }, 
    {
        "image": {
            "url": "/portfolio/arahku-mock.jpeg",
            "alt": "mock arahku application"
        },
        "isSelected": true,
        "title": "Arahku",
        "slug": "arahku",
        "estimate": {
            "start": "2023-05",
            "end": "2023-06"
        },
        "position": "As a Backend Developer",
        "brief": "Arahku adalah aplikasi berbasis Machine Learning yang membantu calon mahasiswa dalam menemukan potensi diri dan menentukan arah pendidikan yang sesuai. Dengan menjawab beberapa pertanyaan terkait minat dan kepribadian, sistem akan menganalisis data tersebut untuk mengidentifikasi potensi pengguna serta memberikan rekomendasi kampus dan jurusan yang paling cocok. Arahku dikembangkan sebagai proyek Capstone dalam program Bangkit Academy 2023.",
        "responsibilities": [
            "Menentukan visi, tujuan, dan ruang lingkup pengembangan aplikasi Arahku.",
            "Merancang arsitektur backend meliputi desain database, struktur API, serta pemilihan teknologi pendukung.",
            "Mengembangkan sisi Backend menggunakan Flask dengan arsitektur RESTful API untuk mendukung integrasi lintas platform.",
            "Mengintegrasikan model Machine Learning berbasis TensorFlow ke dalam sistem backend.",
            "Membangun sistem autentikasi dan manajemen data pengguna yang aman dan efisien.",
            "Melakukan deployment dan pengujian sistem di Google Cloud Platform (GCP) untuk memastikan performa, skalabilitas, dan reliabilitas aplikasi."
        ],
        "result": "Tim Arahku berhasil menjadi salah satu dari 68 tim Capstone terbaik dari lebih dari 700+ tim di Bangkit Academy 2023, serta mendapatkan apresiasi positif dari juri dan reviewer atas inovasi dan keakuratan sistemnya.",
        "stacks": ["Flask", "Kotlin", "PostgreSQL", "TensorFlow", "GCP"]
    }, 
    {
        "image": {
            "url": "/portfolio/kopi-pas-mock.jpeg",
            "alt": "mock kopi pas application"
        },
        "isSelected": false,
        "title": "Aplikasi Kopi Pas",
        "slug": "aplikasi-kopi-pas",
        "estimate": {
            "start": "2022-10",
            "end": "2022-12"
        },
        "position": "As a Backend Developer",
        "brief": "Arahku adalah aplikasi berbasis Machine Learning yang membantu calon mahasiswa dalam menemukan potensi diri dan menentukan arah pendidikan yang sesuai. Dengan menjawab beberapa pertanyaan terkait minat dan kepribadian, sistem akan menganalisis data tersebut untuk mengidentifikasi potensi pengguna serta memberikan rekomendasi kampus dan jurusan yang paling cocok. Arahku dikembangkan sebagai proyek Capstone dalam program Bangkit Academy 2023.",
        "responsibilities": [
            "Menentukan visi, tujuan, dan ruang lingkup pengembangan aplikasi Arahku.",
            "Merancang arsitektur backend meliputi desain database, struktur API, serta pemilihan teknologi pendukung.",
            "Mengembangkan sisi Backend menggunakan Flask dengan arsitektur RESTful API untuk mendukung integrasi lintas platform.",
            "Mengintegrasikan model Machine Learning berbasis TensorFlow ke dalam sistem backend.",
            "Membangun sistem autentikasi dan manajemen data pengguna yang aman dan efisien.",
            "Melakukan deployment dan pengujian sistem di Google Cloud Platform (GCP) untuk memastikan performa, skalabilitas, dan reliabilitas aplikasi."
        ],
        "result": "Tim Arahku berhasil menjadi salah satu dari 68 tim Capstone terbaik dari lebih dari 700+ tim di Bangkit Academy 2023, serta mendapatkan apresiasi positif dari juri dan reviewer atas inovasi dan keakuratan sistemnya.",
        "stacks": ["Laravel", "Tailwind", "Flutter", "Vue.js", "MySql"]
    },
    {
        "image": {
            "url": "/portfolio/web-policy-mock.jpeg",
            "alt": "mock web policy"
        },
        "isSelected": false,
        "title": "Website Official UKM-POLICY",
        "slug": "website-official-ukm-policy",
        "estimate": {
            "start": "2021-09",
            "end": "2021-11"
        },
        "position": "As a Backend Developer",
        "brief": "Website Official UKM-POLICY merupakan situs resmi Unit Kegiatan Mahasiswa Programming Community (POLICY) yang berfungsi sebagai pusat informasi, dokumentasi kegiatan, dan media publikasi organisasi. Website ini dirancang untuk memperkuat identitas digital UKM serta memudahkan anggota dan publik dalam mengakses berbagai informasi terkait kegiatan, prestasi, dan keanggotaan.",
        "responsibilities": [
            "Merancang dan membangun arsitektur backend menggunakan Laravel dengan konsep MVC.",
            "Membangun sistem manajemen konten (CMS) untuk memudahkan admin dalam mengelola berita, kegiatan, dan anggota.",
            "Mengatur struktur database menggunakan MySQL agar data dapat diakses dan dikelola dengan efisien.",
            "Berkolaborasi dengan tim frontend untuk mengintegrasikan desain antarmuka menggunakan TailwindCSS.",
            "Melakukan testing dan debugging agar website berjalan stabil sebelum dirilis ke publik."
        ],
        "result": "Website UKM-POLICY berhasil diluncurkan sebagai platform resmi organisasi, digunakan secara aktif untuk publikasi kegiatan dan menjadi sarana komunikasi utama antar anggota.",
        "stacks": ["Laravel", "Tailwind", "MySQL"]
    },
    {
        "image": {
            "url": "/portfolio/wiraku-mock.jpeg",
            "alt": "mock wiraku application"
        },
        "isSelected": false,
        "title": "Wiraku",
        "slug": "wiraku",
        "position": "As a Frontend Developer",
        "estimate": {
            "start": "2021-06",
            "end": "2021-08"
        },
        "brief": "Wiraku adalah platform pembelajaran digital yang berfokus pada pengembangan wirausaha muda di Indonesia. Website ini menyediakan berbagai kursus online, artikel bisnis, serta komunitas interaktif untuk membantu pengguna memperluas wawasan dan mengembangkan kemampuan dalam membangun usaha.",
        "responsibilities": [
            "Mengembangkan antarmuka pengguna (frontend) menggunakan Vue.js dan TailwindCSS dengan tampilan yang responsif dan modern.",
            "Menerapkan desain berdasarkan wireframe dan panduan UI/UX yang telah ditetapkan tim desain.",
            "Membangun halaman utama, dashboard kursus, dan halaman detail pelatihan.",
            "Mengintegrasikan data dari API backend menggunakan Axios untuk menampilkan konten dinamis.",
            "Mengoptimalkan performa tampilan agar ringan dan cepat diakses di berbagai perangkat.",
            "Berkoordinasi dengan tim backend untuk memastikan integrasi fitur dan data berjalan lancar."
        ],
        "result": "Website Wiraku berhasil menampilkan tampilan antarmuka yang modern dan interaktif, memberikan pengalaman belajar yang mudah diakses bagi pengguna yang ingin mengembangkan usaha mereka secara digital.",
        "stacks": ["Laravel", "Vue.js", "Tailwind", "MySQL"]
    }
]